status/2022/1111.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-10-28 Sat 04:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>05 November 2022 - 11 November 2022</title>
<meta name="author" content="Daniel Kelley" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">05 November 2022 - 11 November 2022</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgfc3a6eb">1. MIT OCW</a>
<ul>
<li><a href="#orgace617c">1.1. 18.02 - Multiple Variable Calculus</a>
<ul>
<li><a href="#org904ba2e">1.1.1. Final</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org8a91c26">2. Mill Controller #2</a>
<ul>
<li><a href="#orga43fd38">2.1. Repurpose 'boss' hard drive</a></li>
<li><a href="#org3fd7a11">2.2. Need to investigate new HW/SW for eventual replacements</a>
<ul>
<li><a href="#orgcd9f546">2.2.1. Old crap ain't gonna last forever</a></li>
<li><a href="#org92362f7">2.2.2. Buildroot/Linux 5.15 PREEMPT + latency tools</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org8e1ef8c">3. Alum Rock Data Center</a>
<ul>
<li><a href="#orgcd08d07">3.1. need to check rocky, others? (arch?) for suitability</a></li>
</ul>
</li>
<li><a href="#org2c2fac3">4. OLPC</a>
<ul>
<li><a href="#org809e07a">4.1. Needs ML1120 coin batteries to fix "invalid system date".</a></li>
</ul>
</li>
<li><a href="#org2623f66">5. Virtual Orchestra</a>
<ul>
<li><a href="#orgd8d3eae">5.1. sfz file tests</a>
<ul>
<li><a href="#orgfc90817">5.1.1. need tooling to edit sample files</a></li>
</ul>
</li>
<li><a href="#org19c4ca1">5.2. increasingly skeptical whether quality results are possible</a></li>
<li><a href="#org97d7c9d">5.3. maybe should treat as platform for concatinative synthesis</a></li>
<li><a href="#org0115fe9">5.4. maybe should just accept the limitations and work with it</a></li>
</ul>
</li>
<li><a href="#org7238bf8">6. gat</a>
<ul>
<li><a href="#org0520d78">6.1. spectrogram done - matches 'octave' output</a></li>
</ul>
</li>
<li><a href="#org2f1ed25">7. marble computing</a>
<ul>
<li><a href="#org04f0d6c">7.1. Programmable Marble Gate Array</a>
<ul>
<li><a href="#orgc33e82d">7.1.1. Hardware mostly reworked</a></li>
<li><a href="#org649f6e4">7.1.2. Interface schematic and layout done</a></li>
<li><a href="#orgf53b14a">7.1.3. Need better lift arm</a></li>
<li><a href="#org05b7dd5">7.1.4. Need to fix various s/w bugs</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orga93acc7">8. small graphics display</a>
<ul>
<li><a href="#orgcb91eef">8.1. Use 320x480 OLED display and ESP8266+WiFi</a></li>
<li><a href="#org662eb6e">8.2. BWIF (Barely Working Image Format) designed</a></li>
<li><a href="#org62960db">8.3. pamtobwif/bwiftopam mostly complete</a></li>
</ul>
</li>
<li><a href="#orgc0c939c">9. mcd05 32 button/led box</a>
<ul>
<li><a href="#org75ffaf3">9.1. Recovered schematics.</a></li>
<li><a href="#orgc3c0127">9.2. Planning software.</a></li>
<li><a href="#orgbf0d013">9.3. Received STM32F767 Nucleo144 with Ethernet.</a>
<ul>
<li><a href="#org370d41b">9.3.1. Test program running.</a></li>
<li><a href="#org1096398">9.3.2. Need to consider CoAP multicast discovery.</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org479cf53">10. More project ideas</a>
<ul>
<li><a href="#orga79111d">10.1. Zuse Z3 simulation in Verilog</a></li>
<li><a href="#org43d6e26">10.2. GMPForth ports to simulators</a>
<ul>
<li><a href="#orgc9a7a5a">10.2.1. SIMH for some targets (vax)</a></li>
<li><a href="#org908c906">10.2.2. MAME looks interesting for microprocessor system emulations</a></li>
<li><a href="#org8581583">10.2.3. Ports to classic figFORTH targets</a></li>
</ul>
</li>
<li><a href="#org19d91c5">10.3. GMPASM assembler</a></li>
<li><a href="#orga79408d">10.4. Extracting ISO Superboard Forth ROMS for MAME emulation</a></li>
<li><a href="#org3b7fbb1">10.5. 'bwocl' OpenCL tooling</a>
<ul>
<li><a href="#org006fa40">10.5.1. Offline compilation</a></li>
<li><a href="#org8c8498d">10.5.2. Standard Kernel Running</a></li>
</ul>
</li>
<li><a href="#org2b88677">10.6. hardware support for classic 5V CPUs</a>
<ul>
<li><a href="#org65e22cf">10.6.1. RTX2000, CDP1802 still available!</a></li>
<li><a href="#org7d707c0">10.6.2. 6502, 68000, 320C30, others on hand</a></li>
<li><a href="#org6a7699c">10.6.3. CPUs with async bus may be supportable without RAM</a></li>
<li><a href="#orgcef9749">10.6.4. Use Nucleo w/ 5V tolerant IO as boot loader controller</a></li>
<li><a href="#org2ef532a">10.6.5. Could use small foorprint monitor in asm (gmpmon?)</a></li>
<li><a href="#org1b92757">10.6.6. Started planning for 6502.</a></li>
</ul>
</li>
<li><a href="#org3cda6b8">10.7. Existing 'retro' hardware still working?</a>
<ul>
<li><a href="#org342a2db">10.7.1. OSI Superboard</a></li>
<li><a href="#orge1a3e2c">10.7.2. Super Jolt</a></li>
<li><a href="#org03d77ad">10.7.3. Ampro Little Board</a></li>
<li><a href="#org342e290">10.7.4. Rockwell R65F11 Demo board</a></li>
<li><a href="#orgae5b009">10.7.5. NMIX-0016</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgb36d125">11. David Davies</a>
<ul>
<li><a href="#org4fbc3df">11.1. Broadcom BCG? Employee indicted for running a brothel.</a></li>
<li><a href="#org508e7d5">11.2. New case C1923172, consolidated with <b>15</b> Parties.</a></li>
<li><a href="#org12b5ff7">11.3. Next hearing 12/15/2022</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgfc3a6eb" class="outline-2">
<h2 id="orgfc3a6eb"><span class="section-number-2">1.</span> MIT OCW</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgace617c" class="outline-3">
<h3 id="orgace617c"><span class="section-number-3">1.1.</span> 18.02 - Multiple Variable Calculus</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org904ba2e" class="outline-4">
<h4 id="org904ba2e"><span class="section-number-4">1.1.1.</span> Final</h4>
</div>
</div>
</div>
<div id="outline-container-org8a91c26" class="outline-2">
<h2 id="org8a91c26"><span class="section-number-2">2.</span> Mill Controller #2</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orga43fd38" class="outline-3">
<h3 id="orga43fd38"><span class="section-number-3">2.1.</span> Repurpose 'boss' hard drive</h3>
<div class="outline-text-3" id="text-2-1">
<p>
S/W configuration done.
</p>
</div>
</div>
<div id="outline-container-org3fd7a11" class="outline-3">
<h3 id="org3fd7a11"><span class="section-number-3">2.2.</span> Need to investigate new HW/SW for eventual replacements</h3>
<div class="outline-text-3" id="text-2-2">
</div>
<div id="outline-container-orgcd9f546" class="outline-4">
<h4 id="orgcd9f546"><span class="section-number-4">2.2.1.</span> Old crap ain't gonna last forever</h4>
</div>
<div id="outline-container-org92362f7" class="outline-4">
<h4 id="org92362f7"><span class="section-number-4">2.2.2.</span> Buildroot/Linux 5.15 PREEMPT + latency tools</h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
First pass done - boots on real hardware
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org8e1ef8c" class="outline-2">
<h2 id="org8e1ef8c"><span class="section-number-2">3.</span> Alum Rock Data Center</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgcd08d07" class="outline-3">
<h3 id="orgcd08d07"><span class="section-number-3">3.1.</span> need to check rocky, others? (arch?) for suitability</h3>
</div>
</div>
<div id="outline-container-org2c2fac3" class="outline-2">
<h2 id="org2c2fac3"><span class="section-number-2">4.</span> OLPC</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org809e07a" class="outline-3">
<h3 id="org809e07a"><span class="section-number-3">4.1.</span> Needs ML1120 coin batteries to fix "invalid system date".</h3>
</div>
</div>
<div id="outline-container-org2623f66" class="outline-2">
<h2 id="org2623f66"><span class="section-number-2">5.</span> Virtual Orchestra</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-orgd8d3eae" class="outline-3">
<h3 id="orgd8d3eae"><span class="section-number-3">5.1.</span> sfz file tests</h3>
<div class="outline-text-3" id="text-5-1">
</div>
<div id="outline-container-orgfc90817" class="outline-4">
<h4 id="orgfc90817"><span class="section-number-4">5.1.1.</span> need tooling to edit sample files</h4>
</div>
</div>
<div id="outline-container-org19c4ca1" class="outline-3">
<h3 id="org19c4ca1"><span class="section-number-3">5.2.</span> increasingly skeptical whether quality results are possible</h3>
</div>
<div id="outline-container-org97d7c9d" class="outline-3">
<h3 id="org97d7c9d"><span class="section-number-3">5.3.</span> maybe should treat as platform for concatinative synthesis</h3>
</div>
<div id="outline-container-org0115fe9" class="outline-3">
<h3 id="org0115fe9"><span class="section-number-3">5.4.</span> maybe should just accept the limitations and work with it</h3>
<div class="outline-text-3" id="text-5-4">
<p>
One should not be disappointed that a guitar can't sound like a flute.
</p>
</div>
</div>
</div>
<div id="outline-container-org7238bf8" class="outline-2">
<h2 id="org7238bf8"><span class="section-number-2">6.</span> gat</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org0520d78" class="outline-3">
<h3 id="org0520d78"><span class="section-number-3">6.1.</span> spectrogram done - matches 'octave' output</h3>
</div>
</div>
<div id="outline-container-org2f1ed25" class="outline-2">
<h2 id="org2f1ed25"><span class="section-number-2">7.</span> marble computing</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-org04f0d6c" class="outline-3">
<h3 id="org04f0d6c"><span class="section-number-3">7.1.</span> Programmable Marble Gate Array</h3>
<div class="outline-text-3" id="text-7-1">
</div>
<div id="outline-container-orgc33e82d" class="outline-4">
<h4 id="orgc33e82d"><span class="section-number-4">7.1.1.</span> Hardware mostly reworked</h4>
</div>
<div id="outline-container-org649f6e4" class="outline-4">
<h4 id="org649f6e4"><span class="section-number-4">7.1.2.</span> Interface schematic and layout done</h4>
</div>
<div id="outline-container-orgf53b14a" class="outline-4">
<h4 id="orgf53b14a"><span class="section-number-4">7.1.3.</span> Need better lift arm</h4>
</div>
<div id="outline-container-org05b7dd5" class="outline-4">
<h4 id="org05b7dd5"><span class="section-number-4">7.1.4.</span> Need to fix various s/w bugs</h4>
</div>
</div>
</div>
<div id="outline-container-orga93acc7" class="outline-2">
<h2 id="orga93acc7"><span class="section-number-2">8.</span> small graphics display</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-orgcb91eef" class="outline-3">
<h3 id="orgcb91eef"><span class="section-number-3">8.1.</span> Use 320x480 OLED display and ESP8266+WiFi</h3>
</div>
<div id="outline-container-org662eb6e" class="outline-3">
<h3 id="org662eb6e"><span class="section-number-3">8.2.</span> BWIF (Barely Working Image Format) designed</h3>
</div>
<div id="outline-container-org62960db" class="outline-3">
<h3 id="org62960db"><span class="section-number-3">8.3.</span> pamtobwif/bwiftopam mostly complete</h3>
<div class="outline-text-3" id="text-8-3">
<p>
Debugging. Large and small uncompressed bit/gray/pixmaps works on
round-trip PAM comparison test.
</p>
</div>
</div>
</div>
<div id="outline-container-orgc0c939c" class="outline-2">
<h2 id="orgc0c939c"><span class="section-number-2">9.</span> mcd05 32 button/led box</h2>
<div class="outline-text-2" id="text-9">
</div>
<div id="outline-container-org75ffaf3" class="outline-3">
<h3 id="org75ffaf3"><span class="section-number-3">9.1.</span> Recovered schematics.</h3>
</div>
<div id="outline-container-orgc3c0127" class="outline-3">
<h3 id="orgc3c0127"><span class="section-number-3">9.2.</span> Planning software.</h3>
</div>
<div id="outline-container-orgbf0d013" class="outline-3">
<h3 id="orgbf0d013"><span class="section-number-3">9.3.</span> Received STM32F767 Nucleo144 with Ethernet.</h3>
<div class="outline-text-3" id="text-9-3">
</div>
<div id="outline-container-org370d41b" class="outline-4">
<h4 id="org370d41b"><span class="section-number-4">9.3.1.</span> Test program running.</h4>
</div>
<div id="outline-container-org1096398" class="outline-4">
<h4 id="org1096398"><span class="section-number-4">9.3.2.</span> Need to consider CoAP multicast discovery.</h4>
</div>
</div>
</div>
<div id="outline-container-org479cf53" class="outline-2">
<h2 id="org479cf53"><span class="section-number-2">10.</span> More project ideas</h2>
<div class="outline-text-2" id="text-10">
</div>
<div id="outline-container-orga79111d" class="outline-3">
<h3 id="orga79111d"><span class="section-number-3">10.1.</span> Zuse Z3 simulation in Verilog</h3>
<div class="outline-text-3" id="text-10-1">
<p>
Good excuse for floating point ALU design.
</p>
</div>
</div>
<div id="outline-container-org43d6e26" class="outline-3">
<h3 id="org43d6e26"><span class="section-number-3">10.2.</span> GMPForth ports to simulators</h3>
<div class="outline-text-3" id="text-10-2">
</div>
<div id="outline-container-orgc9a7a5a" class="outline-4">
<h4 id="orgc9a7a5a"><span class="section-number-4">10.2.1.</span> SIMH for some targets (vax)</h4>
</div>
<div id="outline-container-org908c906" class="outline-4">
<h4 id="org908c906"><span class="section-number-4">10.2.2.</span> MAME looks interesting for microprocessor system emulations</h4>
<div class="outline-text-4" id="text-10-2-2">
<p>
How to support erzatz systems?
</p>
</div>
</div>
<div id="outline-container-org8581583" class="outline-4">
<h4 id="org8581583"><span class="section-number-4">10.2.3.</span> Ports to classic figFORTH targets</h4>
</div>
</div>
<div id="outline-container-org19d91c5" class="outline-3">
<h3 id="org19d91c5"><span class="section-number-3">10.3.</span> GMPASM assembler</h3>
<div class="outline-text-3" id="text-10-3">
<p>
May be useful for handbuilt and rare systems (DMX1000?).
</p>
</div>
</div>
<div id="outline-container-orga79408d" class="outline-3">
<h3 id="orga79408d"><span class="section-number-3">10.4.</span> Extracting ISO Superboard Forth ROMS for MAME emulation</h3>
</div>
<div id="outline-container-org3b7fbb1" class="outline-3">
<h3 id="org3b7fbb1"><span class="section-number-3">10.5.</span> 'bwocl' OpenCL tooling</h3>
<div class="outline-text-3" id="text-10-5">
</div>
<div id="outline-container-org006fa40" class="outline-4">
<h4 id="org006fa40"><span class="section-number-4">10.5.1.</span> Offline compilation</h4>
</div>
<div id="outline-container-org8c8498d" class="outline-4">
<h4 id="org8c8498d"><span class="section-number-4">10.5.2.</span> Standard Kernel Running</h4>
</div>
</div>
<div id="outline-container-org2b88677" class="outline-3">
<h3 id="org2b88677"><span class="section-number-3">10.6.</span> hardware support for classic 5V CPUs</h3>
<div class="outline-text-3" id="text-10-6">
</div>
<div id="outline-container-org65e22cf" class="outline-4">
<h4 id="org65e22cf"><span class="section-number-4">10.6.1.</span> RTX2000, CDP1802 still available!</h4>
</div>
<div id="outline-container-org7d707c0" class="outline-4">
<h4 id="org7d707c0"><span class="section-number-4">10.6.2.</span> 6502, 68000, 320C30, others on hand</h4>
</div>
<div id="outline-container-org6a7699c" class="outline-4">
<h4 id="org6a7699c"><span class="section-number-4">10.6.3.</span> CPUs with async bus may be supportable without RAM</h4>
</div>
<div id="outline-container-orgcef9749" class="outline-4">
<h4 id="orgcef9749"><span class="section-number-4">10.6.4.</span> Use Nucleo w/ 5V tolerant IO as boot loader controller</h4>
</div>
<div id="outline-container-org2ef532a" class="outline-4">
<h4 id="org2ef532a"><span class="section-number-4">10.6.5.</span> Could use small foorprint monitor in asm (gmpmon?)</h4>
</div>
<div id="outline-container-org1b92757" class="outline-4">
<h4 id="org1b92757"><span class="section-number-4">10.6.6.</span> Started planning for 6502.</h4>
</div>
</div>
<div id="outline-container-org3cda6b8" class="outline-3">
<h3 id="org3cda6b8"><span class="section-number-3">10.7.</span> Existing 'retro' hardware still working?</h3>
<div class="outline-text-3" id="text-10-7">
</div>
<div id="outline-container-org342a2db" class="outline-4">
<h4 id="org342a2db"><span class="section-number-4">10.7.1.</span> OSI Superboard</h4>
<div class="outline-text-4" id="text-10-7-1">
<p>
Unknown. Composite to VGA adapter didn't seem to work. Needs analysis.
Found OSI model 610 board underneath!
</p>
</div>
</div>
<div id="outline-container-orge1a3e2c" class="outline-4">
<h4 id="orge1a3e2c"><span class="section-number-4">10.7.2.</span> Super Jolt</h4>
<div class="outline-text-4" id="text-10-7-2">
<p>
No output. Needs analysis.
</p>
</div>
</div>
<div id="outline-container-org03d77ad" class="outline-4">
<h4 id="org03d77ad"><span class="section-number-4">10.7.3.</span> Ampro Little Board</h4>
<div class="outline-text-4" id="text-10-7-3">
<p>
Not booting. Needs analysis.
</p>
</div>
</div>
<div id="outline-container-org342e290" class="outline-4">
<h4 id="org342e290"><span class="section-number-4">10.7.4.</span> Rockwell R65F11 Demo board</h4>
<div class="outline-text-4" id="text-10-7-4">
<p>
UART sending "NO ROM" at 2400 7N1 as expected with 2MHz xtal.
</p>
</div>
</div>
<div id="outline-container-orgae5b009" class="outline-4">
<h4 id="orgae5b009"><span class="section-number-4">10.7.5.</span> NMIX-0016</h4>
<div class="outline-text-4" id="text-10-7-5">
<p>
Works. Found original prom in a parts stash(!).
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-orgb36d125" class="outline-2">
<h2 id="orgb36d125"><span class="section-number-2">11.</span> David Davies</h2>
<div class="outline-text-2" id="text-11">
</div>
<div id="outline-container-org4fbc3df" class="outline-3">
<h3 id="org4fbc3df"><span class="section-number-3">11.1.</span> Broadcom BCG? Employee indicted for running a brothel.</h3>
</div>
<div id="outline-container-org508e7d5" class="outline-3">
<h3 id="org508e7d5"><span class="section-number-3">11.2.</span> New case C1923172, consolidated with <b>15</b> Parties.</h3>
</div>
<div id="outline-container-org12b5ff7" class="outline-3">
<h3 id="org12b5ff7"><span class="section-number-3">11.3.</span> Next hearing 12/15/2022</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Daniel Kelley</p>
<p class="date">Created: 2023-10-28 Sat 04:38</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>